In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
df = pd.read_csv('D:/Datasets/Titanic/test.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df.shape

(418, 11)

In [4]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [5]:
def median_impute(data, feature):
    median = data[feature].median()
    data[feature] = data[feature].fillna(median)
    return data

In [6]:
df = median_impute(df, 'Age')

In [7]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [8]:
df = median_impute(df, 'Fare')

In [9]:
df['Cabin'].fillna('Missing', inplace=True)

In [10]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [11]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,M,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,M,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,M,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,M,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,M,S

In [13]:
df.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [14]:
df.drop(columns=['Name', 'Ticket'], inplace=True)

In [15]:
df.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0          892       3    male  34.5      0      0   7.8292     M        Q
1          893       3  female  47.0      1      0   7.0000     M        S
2          894       2    male  62.0      0      0   9.6875     M        Q
3          895       3    male  27.0      0      0   8.6625     M        S
4          896       3  female  22.0      1      1  12.2875     M        S

In [16]:
df.to_csv('formatedTitanicTest.csv', index=False)

In [17]:
df.tail()

     PassengerId  Pclass     Sex   Age  SibSp  Parch      Fare Cabin Embarked
413         1305       3    male  27.0      0      0    8.0500     M        S
414         1306       1  female  39.0      0      0  108.9000     C        C
415         1307       3    male  38.5      0      0    7.2500     M        S
416         1308       3    male  27.0      0      0    8.0500     M        S
417         1309       3    male  27.0      1      1   22.3583     M        C